JMeter Tests/Test 1.2/report-dashboard-run2/statistics.json
{
  "GET - All Farms (/api/farms)" : {
    "transaction" : "GET - All Farms (/api/farms)",
    "sampleCount" : 2817,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1295.2044728434507,
    "medianResTime" : 1220.0,
    "minResTime" : 928.0,
    "maxResTime" : 4923.0,
    "pct1ResTime" : 1642.0,
    "pct2ResTime" : 1945.5999999999995,
    "pct3ResTime" : 2703.100000000001,
    "throughput" : 9.48344353025141,
    "receivedKBytesPerSec" : 28.01505535059621,
    "sentKBytesPerSec" : 6.631001530917979
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8440,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1099.4547393364896,
    "medianResTime" : 1070.0,
    "minResTime" : 464.0,
    "maxResTime" : 5305.0,
    "pct1ResTime" : 1567.0,
    "pct2ResTime" : 1791.9499999999998,
    "pct3ResTime" : 2611.9500000000007,
    "throughput" : 28.06345532956272,
    "receivedKBytesPerSec" : 66.65005048886606,
    "sentKBytesPerSec" : 20.919281431942796
  },
  "POST - Login (/api/users/login)" : {
    "transaction" : "POST - Login (/api/users/login)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1645.7400000000005,
    "medianResTime" : 1526.0,
    "minResTime" : 914.0,
    "maxResTime" : 3207.0,
    "pct1ResTime" : 2789.7999999999993,
    "pct2ResTime" : 3026.399999999999,
    "pct3ResTime" : 3207.0,
    "throughput" : 0.8141466115218029,
    "receivedKBytesPerSec" : 1.0550513217670239,
    "sentKBytesPerSec" : 0.25124055589930633
  },
  "GET - Harvest History (/api/farms/harvests)" : {
    "transaction" : "GET - Harvest History (/api/farms/harvests)",
    "sampleCount" : 2797,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1296.8248122988923,
    "medianResTime" : 1237.0,
    "minResTime" : 928.0,
    "maxResTime" : 5305.0,
    "pct1ResTime" : 1633.0,
    "pct2ResTime" : 1938.1,
    "pct3ResTime" : 2785.12,
    "throughput" : 9.461630837406762,
    "receivedKBytesPerSec" : 32.33031865242799,
    "sentKBytesPerSec" : 6.698908551874904
  },
  "POST - Submit Inquiry (/api/inquiries)" : {
    "transaction" : "POST - Submit Inquiry (/api/inquiries)",
    "sampleCount" : 2776,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 692.1113112391936,
    "medianResTime" : 588.0,
    "minResTime" : 464.0,
    "maxResTime" : 3732.0,
    "pct1ResTime" : 989.0,
    "pct2ResTime" : 1187.15,
    "pct3ResTime" : 1948.5200000000004,
    "throughput" : 9.45510528000872,
    "receivedKBytesPerSec" : 7.155963468756599,
    "sentKBytesPerSec" : 7.922344072507306
  }
}